let dat = [ // 某一实验全数据格式
    '实验名称',
    {
        'need': [],
        'mach': []
    },
    {
        'name*': '步骤名称',
        'need ': ['所需物质/试剂材料', '材料2'],
        'mach ': ['所需机器/耗材'],
        'envt ': ['环境温度', '干燥程度'],
        'howt ': ['处理方式1', '方式2'],
        'time*': '0sec',
        'resl ': ['预期结果', '温度int', '状态'],
        'metr ': ['预期结果后所有物质', '物质2']
    },
    {
        'name': '...'
    }
]

let example = [
    'RNA提取',
    {
        'need': ['氯仿', '异丙醇溶液', '无RNA酶水', '75%乙醇'],
        'mach': ['通风柜', '涡旋器', '微量移液器', '冷冻微量离心机']
    },

    {
        'name': '4°C 预冷离心机',
        'time': 'skip'
    },
    {
        'name': '步骤 1',
        'need': ['组织或细胞', '无RNA酶水'],
        'mach': ['EP管'],
        'howt': ['将组织或细胞裂解液转移到1.5毫升无RNA酶EP管中', '可置于冰上'],
        'envt': ['0°C~5°C'],
        'time': '5min'
    },
    {
        'name': '步骤 2',
        'need': ['氯仿'],
        'howt': ['每管加入200ul氯仿并充分混合', '可置于冰上'],
        'envt': ['0°C~5°C'],
        'time': '10min'
    },
    {
        'name': '步骤 3',
        'need': ['异丙醇溶液'],
        'mach': ['EP管', '冷冻微量离心机'],
        'howt': ['13000rpm离心', '取一新EP管加入500ul异丙醇预冷'],
        'envt': ['0°C~5°C'],
        'time': '15min'
    },
]